[
  {
    "deal": {
      "product_description": "The Samsung Galaxy Watch Ultra is a premium 47mm LTE Titanium smartwatch designed for both style and functionality. It features a circular display made with durable materials suitable for outdoor activities, providing GPS tracking, health monitoring, and custom apps for various needs. The robust design integrates a range of smart features including notifications, music control, and heart rate tracking, making it an ideal companion for fitness enthusiasts and tech-savvy users alike.",
      "price": 350.0,
      "url": "https://www.dealnews.com/Samsung-Galaxy-Watch-Ultra-47-mm-LTE-Titanium-Smartwatch-up-to-350-off-w-Trade-in-free-shipping/21663266.html?iref=rss-c142"
    },
    "estimate": 773.8138460593241,
    "discount": 423.8138460593241
  },
  {
    "deal": {
      "product_description": "The Refurbished Unlocked Apple iPhone 14 Pro Max offers an impressive 256GB storage and a huge display, perfect for both media consumption and productivity. Enjoy advanced camera technology for stunning photos. This model is designed to provide a seamless user experience with 5G capabilities for faster downloads and streaming. Refurbished to high standards, it comes in various colors and can support all the latest apps from the App Store, accommodating any Apple enthusiast's needs.",
      "price": 705.0,
      "url": "https://www.dealnews.com/products/Apple/Unlocked-Apple-iPhone-14-Pro-Max-256-GB-Smartphone/462808.html?iref=rss-c142"
    },
    "estimate": 930.8824204895075,
    "discount": 225.88242048950747
  },
  {
    "deal": {
      "product_description": "The Samsung U7900 Series UN70U7900FFXZA 70\" 4K UHD LED Smart TV delivers an impressive viewing experience with its vivid 4K resolution and remarkable upscaling capabilities. Featuring a 60Hz refresh rate, this smart TV ensures smooth motion while watching your favorite shows and movies. It is equipped with multiple HDMI ports for seamless connectivity with various devices. This large-screen TV is perfect for family movie nights or immersive gaming sessions, bringing your entertainment to life.",
      "price": 398.0,
      "url": "https://www.dealnews.com/products/Samsung/Samsung-U7900-Series-UN70-U7900-FFXZA-70-4-K-UHD-LED-Smart-TV-2025/495446.html?iref=rss-c142"
    },
    "estimate": 667.9693292770793,
    "discount": 269.9693292770793
  },
  {
    "deal": {
      "product_description": "The Lenovo IdeaPad Slim 3 is a powerful 15.6-inch touchscreen laptop that features an AMD Ryzen 7 5825U processor, providing speedy performance for everyday tasks. With 16GB of RAM and a 512GB SSD, this laptop ensures smooth multitasking and ample storage for your files and applications. The Windows 11 operating system offers a modern user interface and enhanced features, making this laptop an excellent choice for students and professionals alike.",
      "price": 410.0,
      "url": "https://www.dealnews.com/products/Lenovo/Lenovo-Idea-Pad-Slim-3-Ryzen-7-15-6-Touchscreen-Laptop/488146.html?iref=rss-c39"
    },
    "estimate": 677.6979126424488,
    "discount": 267.69791264244884
  },
  {
    "deal": {
      "product_description": "The Unlocked Samsung Galaxy S22 Ultra is a powerful smartphone featuring a Qualcomm Snapdragon 8 Gen 1 processor and a stunning 6.8\" WQHD+ display. With 8GB of RAM and 128GB of internal storage, it's equipped to handle all your apps and media seamlessly. The device boasts an impressive camera system, including a 108MP rear camera and a 40MP front camera, making it perfect for photography enthusiasts. This device runs on Android 12 and offers various features for a top-tier mobile experience.",
      "price": 224.0,
      "url": "https://www.dealnews.com/products/Samsung/Unlocked-Samsung-Galaxy-S22-Ultra-128-GB-Phone/325190.html?iref=rss-c142"
    },
    "estimate": 601.8093686461326,
    "discount": 377.8093686461326
  },
  {
    "deal": {
      "product_description": "The Alienware 27\" 1440p 280Hz Gaming Monitor is engineered for rapid refresh rates and stunning visuals, making it ideal for gamers. With a native resolution of 2560x1440, it offers vibrant colors and clarity paired with FreeSync and G-Sync compatibility for a tear-free experience. The monitor includes multiple connectivity options with one DisplayPort and two HDMI inputs for versatile use. This purchase also includes free shipping.",
      "price": 355.0,
      "url": "https://www.dealnews.com/products/Alienware/Alienware-27-1440-p-280-Hz-Fast-IPS-Gaming-Monitor/433494.html?iref=rss-c39"
    },
    "estimate": 585.6465481244048,
    "discount": 230.64654812440483
  },
  {
    "deal": {
      "product_description": "The TCL S5 58S5F is a 58-inch 4K HDR LED Smart TV that offers superior picture quality with its stunning clarity and vibrant colors. It is equipped with a user-friendly interface that allows easy access to streaming apps and your favorite shows. With HDR technology, this TV enhances the viewing experience, making it perfect for movie nights or gaming sessions. It delivers a well-rounded audio-visual experience that is ideal for any entertainment setup.",
      "price": 230.0,
      "url": "https://www.dealnews.com/products/TCL/TCL-S5-58-S5-F-58-4-K-HDR-LED-Smart-TV/494064.html?iref=rss-c142"
    },
    "estimate": 483.22075896191063,
    "discount": 253.22075896191063
  },
  {
    "deal": {
      "product_description": "The Amazon eero 6+ Mesh WiFi System gigabit 3-pack is designed to ensure consistent high-speed internet coverage throughout your home, supporting connections for up to 75+ devices. It utilizes the latest WiFi 6 technology, enabling faster speeds and greater efficiency. With a coverage area of up to 4,500 square feet, it eliminates dead zones and buffering, making it perfect for streaming, gaming, and smart home devices. Setting it up is straightforward, and it seamlessly integrates with other smart home hubs.",
      "price": 195.0,
      "url": "https://www.dealnews.com/products/eero/Amazon-eero-6-Mesh-Wi-Fi-System-Gigabit-3-Pack/495012.html?iref=rss-f1912"
    },
    "estimate": 300.5461392866532,
    "discount": 105.54613928665322
  }
]